## Sorting

### Pandas sort_values() method sorts a data frame in Ascending or Descending order of passed Column.

####  Syntax: DataFrame.sort_values(by, axis=0, ascending=True, inplace=False, kind=’quicksort’)

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('G:\downloads\sample.csv',names=['Name','Age','Place'])

In [4]:
df

       Name  Age       Place
0    sriram   20    new york
1  santhosh   20  new jersey
2     danny   20    warangal
3      john   21      london
4     mohan   20  california

In [5]:
df.index=['a','b','c','d','e']

In [6]:
df

       Name  Age       Place
a    sriram   20    new york
b  santhosh   20  new jersey
c     danny   20    warangal
d      john   21      london
e     mohan   20  california

#### Sort Dataframe rows based on a single column.

In [7]:
df1=df.sort_values(by='Name')

In [8]:
df1

       Name  Age       Place
c     danny   20    warangal
d      john   21      london
e     mohan   20  california
b  santhosh   20  new jersey
a    sriram   20    new york

####  Sort Dataframe rows based on a multiple columns.

#### if duplicate value is present in 'Name' column 
#### then sorting will be done according to 'Age' column

In [9]:
df2=df.sort_values(by=['Name','Age'])

In [10]:
df2

       Name  Age       Place
c     danny   20    warangal
d      john   21      london
e     mohan   20  california
b  santhosh   20  new jersey
a    sriram   20    new york

#### Sort Dataframe rows based on columns in Descending Order.

In [11]:
df3=df.sort_values(by='Name',ascending=False)

In [12]:
df3

       Name  Age       Place
a    sriram   20    new york
b  santhosh   20  new jersey
e     mohan   20  california
d      john   21      london
c     danny   20    warangal

#### Largest and Smallest value

In [16]:
df['Age'].nlargest(5)

d    21
c    20
e    20
b    20
a    20
Name: Age, dtype: int64

In [17]:
df['Age'].nsmallest(2)

c    20
e    20
Name: Age, dtype: int64

## Aggreation and Grouping

### Aggregation

#### Aggregation is the process of turning the values of a dataset (or a subset of it) into one single value

#### 1.count()
#### 2.sum()
#### 3.min() and .max()
#### 4.mean() and .median()

In [20]:
animal=pd.read_csv('G:\downloads\zoo.csv')

In [21]:
animal

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

### 1.count() :  counts the total no. of values in a df or a partcular column/row

##### Total no of values in df

In [22]:
animal.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

##### total no. of values in particular column

In [23]:
animal['animal'].count()

22

In [24]:
animal.animal.count()

22

##### total no. of values in row

In [25]:
animal.loc[2].count()

3

### 2.sum() : sum's total values

##### Total sum of df

In [26]:
animal.sum()

animal        elephantelephantelephanttigertigertigertigerti...
uniq_id                                                   22253
water_need                                                 7650
dtype: object

##### Along column

In [27]:
animal['uniq_id'].sum()

22253

### 3.min() and max() :calculating maximum and minimum values along df and column
###  .min()

##### Along df

In [29]:
animal.min()

animal        elephant
uniq_id           1001
water_need          80
dtype: object

##### Along column

In [30]:
animal.water_need.min()

80

### .max()
##### Along df

In [32]:
animal.max()

animal        zebra
uniq_id        1022
water_need      600
dtype: object

##### Along column

In [33]:
animal['uniq_id'].max()

1022

### 4.mean() and .median() : calculating mean and median along df and columns

### .mean()

In [37]:
animal.mean()

uniq_id       1011.500000
water_need     347.727273
dtype: float64

In [38]:
animal['uniq_id'].mean()

1011.5

### .median()

In [39]:
animal.median()

uniq_id       1011.5
water_need     325.0
dtype: float64

In [40]:
animal['uniq_id'].median()

1011.5

In [41]:
animal['water_need'].median()

325.0

### Grouping

####  Grouping similar kind of object's and applying aggregate function's on that groups.The grouping can be done by applying groupby keyword

#### In general, groupby is used to split and apply function.
#### split :                        split the df values according to the requirement.
#### apply function :       applying aggregate functions on groups.

In [43]:
animal

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

In [45]:
a=animal.groupby('animal')

In [46]:
a.median()

          uniq_id  water_need
animal
elephant   1002.0       550.0
kangaroo   1021.0       410.0
lion       1017.5       460.0
tiger      1006.0       310.0
zebra      1012.0       220.0

In [47]:
a

In [49]:
a.get_group('lion')

   animal  uniq_id  water_need
15   lion     1016         420
16   lion     1017         600
17   lion     1018         500
18   lion     1019         390